#+BEGIN_COMMENT
.. title: The Rod Cutting Problem
.. slug: the-rod-cutting-problem
.. date: 2022-05-29 15:21:31 UTC-07:00
.. tags: dynamic programming,algorithms
.. category: Algorithms
.. link: 
.. description: A look at the Rod-Cutting Problem.
.. type: text
.. has_pseudocode: yassir
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-6a9dbf4e-3c2c-44d5-b4bd-771599850477-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
*** The First Example

The first thing we're going to do is to check the example given earlier, padding the price-list to make it have 10 entries. I originally had it just short-circuit if the list was shorter but then the counts were off by a little bit so I decided to get rid of that. It might make it slightly more efficient in certain cases, but brute-force isn't really what we're going for anyway.

#+begin_src python :results output :exports both
PRICES = [0, 1, 5, 8, 9, 10, 17, 17, 20, 0, 0]
best_total, count = cut_rod_brute_force(PRICES, 10)
expect(best_total).to(equal(27))
expect(count).to(equal(2**10))
print(f"Best Total Value: {best_total}")
print(f"Count: {count:,}")
print(f"Combinations: {2**10:,}")
#+end_src

#+RESULTS:
: Best Total Value: 27
: Count: 1,024
: Combinations: 1,024

So our actual best value is 27, not the 26 from the sub-set of combinations I used in the earlier example.
** Python Version
#+begin_src python :results none
def cut_rod_memoized(prices: list, length: int) -> int:
    """Finds the maximum value for a rod after it has been cut up

    Args:
     prices: map of length to price
     length: the length of the rod to be cut up

    Returns:
     the maximum value that can be gained by cutting up and selling the rod
    """
    table = [float("-inf")] * (length + 1)
    return cut_rod_memoized_auxiliary(prices, length, table)
#+end_src

#+begin_src python :results none
def cut_rod_memoized_auxiliary(prices: list, length: int, best_values: list, count: int=0) -> int:
    """Find the maximum value from cutting up and selling rod

    Args:
     prices: map of length to price
     length: the length of the rod to be cut up
     best_values: lookup-table for previously calculated values (index is starting length)

    Returns:
     the maximum value that can be gained by cutting up and selling the rod
    """
    count += 1
    if best_values[length] >= 0:
        return best_values[length], count

    if length == 0:
        best_total = 0
    else:
        best_total = float("-inf")
        for next_cut in range(1, length + 1):
            leftover = length - next_cut
            next_total, count = cut_rod_memoized_auxiliary(prices,
                                                           leftover,
                                                           best_values,
                                                           count)
            best_total = max(best_total,
                             prices[next_cut] + next_total)
    best_values[length] = best_total
    return best_total, count
#+end_src

#+begin_src python :results output :exports both
best_total, count = cut_rod_memoized(PRICES, 4)
print(f"Best Total Value: {best_total}")
print(f"Count: {count}")
#+end_src

#+RESULTS:
: Best Total Value: 10
: Count: 11

#+begin_src python :results output :exports both
best_total, count = cut_rod_memoized(PRICES, 5)
print(f"Best Total Value: {best_total}")
print(f"Count: {count}")
#+end_src

#+RESULTS:
: Best Total Value: 13
: Count: 16


** Example
#+begin_src python :results output :exports both
best_total, count = cut_rod_memoized(PRICES, 10)
expect(best_total).to(equal(27))
expect(count).to(equal(1 + (10 * 11)/2))
print(f"Best Total Value: {best_total}")
print(f"Count: {count}")
#+end_src

#+RESULTS:
: Best Total Value: 27
: Count: 56

We've gone from 1,024 calls to 56 calls, a pretty good improvement. The number of calls comes from the for loop plus one for the initial call. The for loop goes from 1 through the length of the rod, but passes in the difference between the starting length and the loop value. So if we start with a length of 4, the for-loop makes recursive calls using lengths of 4-1=3, 4-2=2, 4-3=1, 4-4=0. But then each of the calls goes through the for-loop as well (except for the base-case of 0). Since the first call of the for-loop is always one less than the starting length, we end up memoizing the values for all the starting lengths as we go so the subsequent calls don't need to go into the for-loop. So the number of calls we make equals \(1 + 2 + \cdots + n\) plus one for the first call before the recursion starts. This means the runtime is

\[
1 + \sum_{i=1}^n i = 1 + \frac{n(n+1)}{2} \Rightarrow O(n^2)
\]

So for our case with length 10, we have

\begin{align}
T(10) &= \frac{10(10 + 1)}{2} + 1\\
      &= 56
\end{align}

** The Example Again
#+begin_src python :results output :exports both
best_total, count = cut_rod_bottom_up(PRICES, 10)
expect(best_total).to(equal(27))
expect(count).to(equal(1 + 110/2))
print(f"Best Total Value: {best_total}")
print(f"Count: {count}")
#+end_src

#+RESULTS:
: Best Total Value: 27
: Count: 56

The runtime for this version is the same as the memoized version. It's sort of the backwards case - the inner for-loop runs 1 then 1, 2, then 1, 2, 3 up to the length of the rod, so the number of times it runs is \(1 + 2 + 3 + \cdots + n\) while the memoized count goes \(n + \cdots + 3 + 2 + 1\). In any case, the count ends up the same.

\[
1 + \sum_{i=1}^n i = 1 + \frac{n(n+1)}{2} \Rightarrow O(n^2)
\]

** In Python
#+begin_src python :results none
def cut_rod_extended(prices: list, length: int) -> tuple:
    """Find the maximum values for a cut rod

    Args:
     prices: map of length to price
     length: total length of rod to cut up

    Returns:
     best-revenues, best-lengths
    """
    best_revenues = [0] * (length + 1)
    best_cuts = [0] * (length + 1)

    for next_length in range(1, length + 1):
        best_revenue = float("-inf")
        for next_cut in range(1, next_length + 1):
            remaining_length = next_length - next_cut
            next_revenue = prices[next_cut] + best_revenues[next_length - next_cut]
            if best_revenue < next_revenue:
                best_revenue = next_revenue
                best_cuts[next_length] = next_cut
        best_revenues[next_length] = best_revenue
    return best_revenues, best_cuts
#+end_src

#+begin_src python :results none
def print_solution(prices: list, length: int) -> tuple:
    """Solve and print the best cuts to maximize revenue

    Args:
     prices: list mapping length to price
     length: the pre-cut length of the rod

    Returns:
     best_revenues, best_cuts
    """
    revenues, cuts = cut_rod_extended(prices, length)
    check, remaining_length = 0, length
    output = []
    while remaining_length > 0:
        next_cut = cuts[remaining_length]
        check += next_cut
        output.append(str(next_cut))
        remaining_length -= next_cut
    print(f"Best Revenue for rod of length {length}: {revenues[length]}")
    print(f"Cuts: ({', '.join(output)})")
    expect(check).to(equal(length))
    return revenues, cuts
#+end_src

#+begin_src python :results output :exports both
print_solution(PRICES, 10)
#+end_src

#+RESULTS:
: Best Revenue for rod of length 10: 27
: Cuts: (2, 2, 6)

** CLRS Example

#+begin_src python :results output :exports both
CLRS_PRICES = [0, 1, 5, 8, 9, 10, 17, 17, 20, 24, 30]
revenues, cuts = print_solution(CLRS_PRICES, 10)
expect(revenues).to(contain_exactly(0, 1, 5, 8, 10, 13, 17, 18, 22, 25, 30))
expect(cuts).to(contain_exactly(0, 1, 2, 3, 2, 2, 6, 1, 2, 3, 10))
#+end_src

#+RESULTS:
: Best Revenue for rod of length 10: 30
: Cuts: (10)

#+begin_src python :results output :exports both
for length in range(1, 11):
    print_solution(CLRS_PRICES, length)
    print()
#+end_src

#+RESULTS:
#+begin_example
Best Revenue for rod of length 1: 1
Cuts: (1)

Best Revenue for rod of length 2: 5
Cuts: (2)

Best Revenue for rod of length 3: 8
Cuts: (3)

Best Revenue for rod of length 4: 10
Cuts: (2, 2)

Best Revenue for rod of length 5: 13
Cuts: (2, 3)

Best Revenue for rod of length 6: 17
Cuts: (6)

Best Revenue for rod of length 7: 18
Cuts: (1, 6)

Best Revenue for rod of length 8: 22
Cuts: (2, 6)

Best Revenue for rod of length 9: 25
Cuts: (3, 6)

Best Revenue for rod of length 10: 30
Cuts: (10)
#+end_example

